load/results/20260914-231108-products-page-vus5.txt


  █ TOTAL RESULTS 

    checks_total.......: 12438   828.986934/s
    checks_succeeded...: 100.00% 12438 out of 12438
    checks_failed......: 0.00%   0 out of 12438

    ✓ products page 200

    HTTP
    http_req_duration..............: avg=5.95ms min=505.1µs med=5.71ms max=24.32ms p(90)=7.92ms p(95)=8.98ms
      { expected_response:true }...: avg=5.95ms min=505.1µs med=5.71ms max=24.32ms p(90)=7.92ms p(95)=8.98ms
    http_req_failed................: 0.00%  0 out of 12438
    http_reqs......................: 12438  828.986934/s

    EXECUTION
    iteration_duration.............: avg=6.02ms min=505.1µs med=5.76ms max=24.32ms p(90)=7.96ms p(95)=9.06ms
    iterations.....................: 12438  828.986934/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 164 MB 11 MB/s
    data_sent......................: 1.1 MB 71 kB/s